Jmeter Yudina/JMeter_Results.jtl/statistics.json
{
  "Debug Sampler" : {
    "transaction" : "Debug Sampler",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 0.0,
    "medianResTime" : 0.0,
    "minResTime" : 0.0,
    "maxResTime" : 0.0,
    "pct1ResTime" : 0.0,
    "pct2ResTime" : 0.0,
    "pct3ResTime" : 0.0,
    "throughput" : 12.033694344163658,
    "receivedKBytesPerSec" : 7.855981122141998,
    "sentKBytesPerSec" : 0.0
  },
  "Registration" : {
    "transaction" : "Registration",
    "sampleCount" : 10,
    "errorCount" : 8,
    "errorPct" : 80.0,
    "meanResTime" : 1428.3999999999999,
    "medianResTime" : 706.0,
    "minResTime" : 275.0,
    "maxResTime" : 4248.0,
    "pct1ResTime" : 4237.8,
    "pct2ResTime" : 4248.0,
    "pct3ResTime" : 4248.0,
    "throughput" : 2.3540489642184554,
    "receivedKBytesPerSec" : 0.88736611346516,
    "sentKBytesPerSec" : 0.7885144479755178
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 60,
    "errorCount" : 18,
    "errorPct" : 30.0,
    "meanResTime" : 838.5666666666662,
    "medianResTime" : 363.0,
    "minResTime" : 0.0,
    "maxResTime" : 4248.0,
    "pct1ResTime" : 3173.8,
    "pct2ResTime" : 3219.4,
    "pct3ResTime" : 4248.0,
    "throughput" : 10.666666666666666,
    "receivedKBytesPerSec" : 5.449826388888889,
    "sentKBytesPerSec" : 2.8477430555555556
  },
  "Logout" : {
    "transaction" : "Logout",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 100.4,
    "medianResTime" : 102.0,
    "minResTime" : 90.0,
    "maxResTime" : 108.0,
    "pct1ResTime" : 108.0,
    "pct2ResTime" : 108.0,
    "pct3ResTime" : 108.0,
    "throughput" : 33.67003367003367,
    "receivedKBytesPerSec" : 15.815709175084177,
    "sentKBytesPerSec" : 8.739741161616163
  },
  "Add expenses" : {
    "transaction" : "Add expenses",
    "sampleCount" : 10,
    "errorCount" : 10,
    "errorPct" : 100.0,
    "meanResTime" : 532.4,
    "medianResTime" : 715.0,
    "minResTime" : 90.0,
    "maxResTime" : 722.0,
    "pct1ResTime" : 722.0,
    "pct2ResTime" : 722.0,
    "pct3ResTime" : 722.0,
    "throughput" : 10.857763300760043,
    "receivedKBytesPerSec" : 4.559412323561346,
    "sentKBytesPerSec" : 4.249796416938111
  },
  "Login" : {
    "transaction" : "Login",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2622.3,
    "medianResTime" : 3169.5,
    "minResTime" : 1079.0,
    "maxResTime" : 3220.0,
    "pct1ResTime" : 3218.8,
    "pct2ResTime" : 3220.0,
    "pct3ResTime" : 3220.0,
    "throughput" : 2.3261223540358222,
    "receivedKBytesPerSec" : 1.471544981391021,
    "sentKBytesPerSec" : 0.6519503082112118
  },
  "Add car" : {
    "transaction" : "Add car",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 347.90000000000003,
    "medianResTime" : 363.0,
    "minResTime" : 102.0,
    "maxResTime" : 722.0,
    "pct1ResTime" : 686.1000000000001,
    "pct2ResTime" : 722.0,
    "pct3ResTime" : 722.0,
    "throughput" : 8.375209380234505,
    "receivedKBytesPerSec" : 4.30047372278057,
    "sentKBytesPerSec" : 2.811093226549414
  }
}